# Brewfile - Homebrew Bundle
# Install: brew bundle --file=~/.dotfiles/Brewfile
# Sync:    brewsync --pull

# Tap repositories
tap "homebrew/cask-versions"
tap "shopify/shopify"

# CLI tools
brew "archey"
brew "bat"
brew "chezmoi"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "figlet"
brew "fzf"
brew "imagemagick"
brew "jq"
brew "ksdiff"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "mkcert"
brew "neovim"
brew "nmap"
brew "poppler"
brew "ripgrep"
brew "shopify-cli"
brew "themekit"
brew "tldr"
brew "um"
brew "unar"
brew "yazi"
brew "youtube-dl"
brew "zellij"
brew "zoxide"

# Fonts
cask "font-droid-sans-mono-for-powerline"

# Terminal emulators
cask "iterm2"
cask "kitty"

# Productivity
cask "1password"
cask "1password-cli"
cask "alfred"
cask "cheatsheet"
cask "daisydisk"
cask "dropbox"
cask "jumpshare"
cask "muzzle"
cask "notion"
cask "numi"
cask "raindropio"
cask "rectangle"

# Browsers
cask "firefox-developer-edition"
cask "google-chrome"
cask "safari-technology-preview"
cask "vivaldi"

# Communication
cask "skype"
cask "slack"
cask "whatsapp"

# Media
cask "fliqlo"
cask "spotify"
cask "vlc"

# Development
cask "dash"
cask "docker"
cask "gas-mask"
cask "iconjar"
cask "kitematic"
cask "omnigraffle"
cask "poedit"
cask "postman"
cask "sequel-pro"
cask "sketch"
cask "table-tool"
cask "termius"
cask "transmit"
cask "visual-studio-code"

# Virtualization
cask "parallels"
cask "virtualbox"

# Utilities
cask "ibettercharge"
cask "the-unarchiver"
cask "tinypng4mac"

# Mac App Store apps (requires: brew install mas)
mas "Bible", id: 917664748
mas "GIF Brewery 3", id: 1081413713
mas "HTML Email Signature - Outlook", id: 1101267774
mas "Kaleidoscope", id: 587512244
mas "MemoryKeeper", id: 689992800
mas "Quick Look plugin", id: 1513574319
mas "SnippetsLab", id: 1006087419
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
